Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
/***************************************************************************//**
 * @file sl_cli_command_table.c
 * @brief Declarations of relevant command structs for cli framework.
 * @version x.y.z
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stdlib.h>

#include "sl_cli_config.h"
#include "sl_cli_command.h"
#include "sl_cli_arguments.h"

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 *****************************   TEMPLATED FILE   ******************************
 ******************************************************************************/

/*******************************************************************************
 * Example syntax (.slcc or .slcp) for populating this file:
 *
 *   template_contribution:
 *     - name: cli_command          # Register a command
 *       value:
 *         name: status             # Name of command
 *         handler: status_command  # Function to be called. Must be defined
 *         help: "Prints status"    # Optional help description
 *         shortcuts:               # Optional shorcut list
 *           - name: st
 *         argument:                # Argument list, if apliccable
 *           - type: uint8          # Variable type
 *             help: "Channel"      # Optional description
 *           - type: string
 *             help: "Text"
 *     - name: cli_group            # Register a group
 *       value:
 *         name: shell              # Group name
 *         help: "Shell commands"   # Optional help description
 *         shortcuts:               # Optional shorcuts
 *           - name: sh
 *     - name: cli_command
 *       value:
 *         name: repeat
 *         handler: repeat_cmd
 *         help: "Repeat commands"
 *         shortcuts:
 *           - name: r
 *           - name: rep
 *         group: shell            # Associate command with group
 *         argument:
 *           - type: string
 *             help: "Text"
 *           - type: additional
 *             help: "More text"
 *
 * For subgroups, an optional unique id can be used to allow a particular name to
 * be used more than once. In the following case, from the command line the
 * following commands are available:
 *
 * >  root_1 shell status
 * >  root_2 shell status
 *
 *     - name: cli_group            # Register a group
 *       value:
 *         name: root_1             # Group name
 *
 *     - name: cli_group            # Register a group
 *       value:
 *         name: root_2             # Group name
 *
 *    - name: cli_group             # Register a group
 *       value:
 *         name: shell              # Group name
 *         id: shell_root_1         # Optional unique id for group
 *         group: root_1            # Add group to root_1 group
 *
 *    - name: cli_group             # Register a group
 *       value:
 *         name: shell              # Group name
 *         id: shell_root_2         # Optional unique id for group
 *         group: root_2            # Add group to root_1 group
 *
 *    - name: cli_command           # Register a command
 *       value:
 *         name: status
 *         handler: status_1
 *         group: shell_root_1      # id of subgroup
 *
 *    - name: cli_command           # Register a command
 *       value:
 *         name: status
 *         handler: status_2
 *         group: shell_root_2      # id of subgroup
 *
 ******************************************************************************/

// Provide function declarations
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void setEventConfig(sl_cli_command_arg_t *arguments);
void resetCounters(sl_cli_command_arg_t *arguments);
void setPeripheralEnable(sl_cli_command_arg_t *arguments);
void setNotifications(sl_cli_command_arg_t *arguments);
void getLogLevels(sl_cli_command_arg_t *arguments);
void getVersion(sl_cli_command_arg_t *arguments);
void getVersionVerbose(sl_cli_command_arg_t *arguments);
void setPtiProtocol(sl_cli_command_arg_t *arguments);
void getPti(sl_cli_command_arg_t *arguments);
void setPrintingEnable(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void rx(sl_cli_command_arg_t *arguments);
void rxAt(sl_cli_command_arg_t *arguments);
void setRxOptions(sl_cli_command_arg_t *arguments);
void tx(sl_cli_command_arg_t *arguments);
void txWithOptions(sl_cli_command_arg_t *arguments);
void txAfterRx(sl_cli_command_arg_t *arguments);
void configTxOptions(sl_cli_command_arg_t *arguments);
void setFixedLength(sl_cli_command_arg_t *arguments);
void setPower(sl_cli_command_arg_t *arguments);
void getPower(sl_cli_command_arg_t *arguments);
void setPowerConfig(sl_cli_command_arg_t *arguments);
void getPowerConfig(sl_cli_command_arg_t *arguments);
void getPowerLimits(sl_cli_command_arg_t *arguments);
void enablePaAutoMode(sl_cli_command_arg_t *arguments);
void configPaAutoMode(sl_cli_command_arg_t *arguments);
void sweepTxPower(sl_cli_command_arg_t *arguments);
void offsetLqi(sl_cli_command_arg_t *arguments);
void getRssi(sl_cli_command_arg_t *arguments);
void sweepPower(sl_cli_command_arg_t *arguments);
void startAvgRssi(sl_cli_command_arg_t *arguments);
void getAvgRssi(sl_cli_command_arg_t *arguments);
void setTxTone(sl_cli_command_arg_t *arguments);
void setTxStream(sl_cli_command_arg_t *arguments);
void getStatus(sl_cli_command_arg_t *arguments);
void fifoStatus(sl_cli_command_arg_t *arguments);
void setTxHoldOff(sl_cli_command_arg_t *arguments);
void setTxDelay(sl_cli_command_arg_t *arguments);
void getTxDelay(sl_cli_command_arg_t *arguments);
void setTxPayload(sl_cli_command_arg_t *arguments);
void setTxRandom(sl_cli_command_arg_t *arguments);
void setTxPayloadQuiet(sl_cli_command_arg_t *arguments);
void setTxLength(sl_cli_command_arg_t *arguments);
void printTxPacket(sl_cli_command_arg_t *arguments);
void peekRx(sl_cli_command_arg_t *arguments);
void getTime(sl_cli_command_arg_t *arguments);
void setTime(sl_cli_command_arg_t *arguments);
void dataConfig(sl_cli_command_arg_t *arguments);
void setRxFifo(sl_cli_command_arg_t *arguments);
void setTxFifoThreshold(sl_cli_command_arg_t *arguments);
void setRxFifoThreshold(sl_cli_command_arg_t *arguments);
void fifoModeTestOptions(sl_cli_command_arg_t *arguments);
void rxFifoManualRead(sl_cli_command_arg_t *arguments);
void txFifoManualLoad(sl_cli_command_arg_t *arguments);
void fifoReset(sl_cli_command_arg_t *arguments);
void abortRxPacket(sl_cli_command_arg_t *arguments);
void printTxAcks(sl_cli_command_arg_t *arguments);
void configRxChannelHopping(sl_cli_command_arg_t *arguments);
void enableRxChannelHopping(sl_cli_command_arg_t *arguments);
void configChannelHoppingOptions(sl_cli_command_arg_t *arguments);
void configChannelHoppingMulti(sl_cli_command_arg_t *arguments);
void getChannelHoppingRssi(sl_cli_command_arg_t *arguments);
void spectrumAnalyzer(sl_cli_command_arg_t *arguments);
void configRxDutyCycle(sl_cli_command_arg_t *arguments);
void enableRxDutyCycle(sl_cli_command_arg_t *arguments);
void getDefaultRxDutyCycleConfig(sl_cli_command_arg_t *arguments);
void setTxAltPreambleLen(sl_cli_command_arg_t *arguments);
void configSyncWords(sl_cli_command_arg_t *arguments);
void getSyncWords(sl_cli_command_arg_t *arguments);
void printRxErrors(sl_cli_command_arg_t *arguments);
void printRxFreqOffsets(sl_cli_command_arg_t *arguments);
void printDataRates(sl_cli_command_arg_t *arguments);
void stopInfinitePreambleTx(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void sleep(sl_cli_command_arg_t *arguments);
void rfSense(sl_cli_command_arg_t *arguments);
void configRfSenseSelectiveOokWakeupPhy(sl_cli_command_arg_t *arguments);
void setRfSenseTxPayload(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void setAddressFilterConfig(sl_cli_command_arg_t *arguments);
void setAddressFilter(sl_cli_command_arg_t *arguments);
void getAddressFilter(sl_cli_command_arg_t *arguments);
void printAddresses(sl_cli_command_arg_t *arguments);
void setAddress(sl_cli_command_arg_t *arguments);
void setAddressMask(sl_cli_command_arg_t *arguments);
void enableAddress(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void startPerMode(sl_cli_command_arg_t *arguments);
void getPerStats(sl_cli_command_arg_t *arguments);
void berConfigSet(sl_cli_command_arg_t *arguments);
void berRx(sl_cli_command_arg_t *arguments);
void berStatusGet(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void setLbtMode(sl_cli_command_arg_t *arguments);
void getLbtParams(sl_cli_command_arg_t *arguments);
void setLbtParams(sl_cli_command_arg_t *arguments);
void set802154CcaMode(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void ieee802154Enable(sl_cli_command_arg_t *arguments);
void config2p4Ghz802154(sl_cli_command_arg_t *arguments);
void config863Mhz802154(sl_cli_command_arg_t *arguments);
void config915Mhz802154(sl_cli_command_arg_t *arguments);
void ieee802154SetE(sl_cli_command_arg_t *arguments);
void ieee802154SetG(sl_cli_command_arg_t *arguments);
void ieee802154SetFpMode(sl_cli_command_arg_t *arguments);
void ieee802154AcceptFrames(sl_cli_command_arg_t *arguments);
void ieee802154SetPromiscuousMode(sl_cli_command_arg_t *arguments);
void setRxToEnhAckTx(sl_cli_command_arg_t *arguments);
void ieee802154SetPanCoordinator(sl_cli_command_arg_t *arguments);
void ieee802154SetPanId(sl_cli_command_arg_t *arguments);
void ieee802154SetShortAddress(sl_cli_command_arg_t *arguments);
void ieee802154SetLongAddress(sl_cli_command_arg_t *arguments);
void ieee802154SetAddresses(sl_cli_command_arg_t *arguments);
void ieee802154ConfigRxChannelSwitching(sl_cli_command_arg_t *arguments);
void ieee802154SetDataReqLatency(sl_cli_command_arg_t *arguments);
void ieee802154SetPHR(sl_cli_command_arg_t *arguments);
void trigModeSwitchTx(sl_cli_command_arg_t *arguments);
void modeSwitchLife(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void bleEnable(sl_cli_command_arg_t *arguments);
void bleStatus(sl_cli_command_arg_t *arguments);
void bleSetChannelParams(sl_cli_command_arg_t *arguments);
void blePhySwitchToRx(sl_cli_command_arg_t *arguments);
void bleAdvertisingConfig(sl_cli_command_arg_t *arguments);
void bleSet1MbpsPhy(sl_cli_command_arg_t *arguments);
void bleSet2MbpsPhy(sl_cli_command_arg_t *arguments);
void bleSetCoding(sl_cli_command_arg_t *arguments);
void bleSetSimulscan(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void configWmbus(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void zwaveEnable(sl_cli_command_arg_t *arguments);
void zwaveStatus(sl_cli_command_arg_t *arguments);
void zwaveSetRegion(sl_cli_command_arg_t *arguments);
void zwavePerformIrcal(sl_cli_command_arg_t *arguments);
void zwaveGetRegion(sl_cli_command_arg_t *arguments);
void zwaveListRegions(sl_cli_command_arg_t *arguments);
void zwaveGetBaudRate(sl_cli_command_arg_t *arguments);
void zwaveSetNodeId(sl_cli_command_arg_t *arguments);
void zwaveSetHomeId(sl_cli_command_arg_t *arguments);
void zwaveConfigureOptions(sl_cli_command_arg_t *arguments);
void zwaveSetLowPowerLevel(sl_cli_command_arg_t *arguments);
void zwaveGetLowPowerLevel(sl_cli_command_arg_t *arguments);
void zwaveReceiveBeam(sl_cli_command_arg_t *arguments);
void mfmEnable(sl_cli_command_arg_t *arguments);
void mfmStatus(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void setTimer(sl_cli_command_arg_t *arguments);
void timerCancel(sl_cli_command_arg_t *arguments);
void printTimerStats(sl_cli_command_arg_t *arguments);
void enableMultiTimer(sl_cli_command_arg_t *arguments);
void setMultiTimer(sl_cli_command_arg_t *arguments);
void multiTimerCancel(sl_cli_command_arg_t *arguments);
void printMultiTimerStats(sl_cli_command_arg_t *arguments);
void delayUs(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void autoAckConfig(sl_cli_command_arg_t *arguments);
void autoAckDisable(sl_cli_command_arg_t *arguments);
void setAckPayload(sl_cli_command_arg_t *arguments);
void setAckLength(sl_cli_command_arg_t *arguments);
void printAckPacket(sl_cli_command_arg_t *arguments);
void getAutoAck(sl_cli_command_arg_t *arguments);
void autoAckPause(sl_cli_command_arg_t *arguments);
void setTxAckOptions(sl_cli_command_arg_t *arguments);
void setTxAckDirect(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void setGpioOutPin(sl_cli_command_arg_t *arguments);
void setAntDivPin(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void cliSeparatorHack(sl_cli_command_arg_t *arguments);
void getConfigIndex(sl_cli_command_arg_t *arguments);
void setConfigIndex(sl_cli_command_arg_t *arguments);
void setCtune(sl_cli_command_arg_t *arguments);
void getCtune(sl_cli_command_arg_t *arguments);
void setCtuneDelta(sl_cli_command_arg_t *arguments);
void getCtuneDelta(sl_cli_command_arg_t *arguments);
void setPaCtune(sl_cli_command_arg_t *arguments);
void enablePaCal(sl_cli_command_arg_t *arguments);
void setDebugSignal(sl_cli_command_arg_t *arguments);
void setDebugMode(sl_cli_command_arg_t *arguments);
void setFrequency(sl_cli_command_arg_t *arguments);
void configDirectMode(sl_cli_command_arg_t *arguments);
void setDirectMode(sl_cli_command_arg_t *arguments);
void setDirectTx(sl_cli_command_arg_t *arguments);
void txCancel(sl_cli_command_arg_t *arguments);
void configHFXOThermistor(sl_cli_command_arg_t *arguments);
void startThermistorMeasurement(sl_cli_command_arg_t *arguments);
void getThermistorImpedance(sl_cli_command_arg_t *arguments);
void getRandom(sl_cli_command_arg_t *arguments);
void setTxUnderflow(sl_cli_command_arg_t *arguments);
void setRxOverflow(sl_cli_command_arg_t *arguments);
void setCalibrations(sl_cli_command_arg_t *arguments);
void setTxTransitions(sl_cli_command_arg_t *arguments);
void setRxTransitions(sl_cli_command_arg_t *arguments);
void getTxTransitions(sl_cli_command_arg_t *arguments);
void getRxTransitions(sl_cli_command_arg_t *arguments);
void setNextTxRepeat(sl_cli_command_arg_t *arguments);
void configTxRepeatStartToStart(sl_cli_command_arg_t *arguments);
void setNextBleTxRepeat(sl_cli_command_arg_t *arguments);
void setTxTimePos(sl_cli_command_arg_t *arguments);
void setRxTimePos(sl_cli_command_arg_t *arguments);
void setTimings(sl_cli_command_arg_t *arguments);
void forceAssert(sl_cli_command_arg_t *arguments);
void getAppMode(sl_cli_command_arg_t *arguments);
void getRadioState(sl_cli_command_arg_t *arguments);
void verifyRadio(sl_cli_command_arg_t *arguments);
void getChannel(sl_cli_command_arg_t *arguments);
void setChannel(sl_cli_command_arg_t *arguments);
void setPktOffsetInTxFifo(sl_cli_command_arg_t *arguments);
void resetChip(sl_cli_command_arg_t *arguments);
void CI_writeRmrStructure(sl_cli_command_arg_t *arguments);
void CI_updateConfigurationPointer(sl_cli_command_arg_t *arguments);
void CI_reconfigureModem(sl_cli_command_arg_t *arguments);
void CI_SetRfPath(sl_cli_command_arg_t *arguments);
void configPrintEvents(sl_cli_command_arg_t *arguments);
void printChipFeatures(sl_cli_command_arg_t *arguments);
void getMemWord(sl_cli_command_arg_t *arguments);
void setMemWord(sl_cli_command_arg_t *arguments);
void throughput(sl_cli_command_arg_t *arguments);
void setRssiOffset(sl_cli_command_arg_t *arguments);
void getRssiOffset(sl_cli_command_arg_t *arguments);
void setRssiDetectThreshold(sl_cli_command_arg_t *arguments);
void getRssiDetectThreshold(sl_cli_command_arg_t *arguments);
void txAtTime(sl_cli_command_arg_t *arguments);
void setFreqOffset(sl_cli_command_arg_t *arguments);
void holdRx(sl_cli_command_arg_t *arguments);
void wait(sl_cli_command_arg_t *arguments);
void clearScript(sl_cli_command_arg_t *arguments);
void printScript(sl_cli_command_arg_t *arguments);
void enterScript(sl_cli_command_arg_t *arguments);
void runScript(sl_cli_command_arg_t *arguments);
void setRetimeOption(sl_cli_command_arg_t *arguments);
void enable802154SignalIdentifier(sl_cli_command_arg_t *arguments);
void enableBleSignalIdentifier(sl_cli_command_arg_t *arguments);
void getChannelConfigEntry(sl_cli_command_arg_t *arguments);
void deinitProtocol(sl_cli_command_arg_t *arguments);
void enableCacheSynthCal(sl_cli_command_arg_t *arguments);

// Command structs. Names are in the format : cli_cmd_{command group name}_{command name}
// In order to support hyphen in command and group name, every occurence of it while
// building struct names will be replaced by "_hyphen_"
static const sl_cli_command_info_t cli_cmd___________________________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______Application_Configuration____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setEventConfig = \
  SL_CLI_COMMAND(setEventConfig,
                 "Control RAIL events.",
                  "eventsMask<31:0>" SL_CLI_UNIT_SEPARATOR "eventsValues<31:0>" SL_CLI_UNIT_SEPARATOR "eventsMask<63:32>\n                    [uint32opt] eventsValues<63:32>" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__resetCounters = \
  SL_CLI_COMMAND(resetCounters,
                 "Resets the TX and RX counters.",
                  "",
                 {SL_CLI_ARG_END, });

