Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__setPeripheralEnable = \
  SL_CLI_COMMAND(setPeripheralEnable,
                 "Control LEDs and LCD peripherals.",
                  "[0=Disable] 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setNotifications = \
  SL_CLI_COMMAND(setNotifications,
                 "Control asynchronous status prints (rxPacket,txEnd,txError).",
                  "0=Disable [1=Enable]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getLogLevels = \
  SL_CLI_COMMAND(getLogLevels,
                 "Show whether notifications or peripherals are enabled.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getVersion = \
  SL_CLI_COMMAND(getVersion,
                 "Get version information.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getVersionVerbose = \
  SL_CLI_COMMAND(getVersionVerbose,
                 "Get verbose version information.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setPtiProtocol = \
  SL_CLI_COMMAND(setPtiProtocol,
                 "Set PTI protocol for Network Analyzer.",
                  "0=Custom 2=Thread 3=BLE 4=Connect 5=Zigbee 6=Z-Wave" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getPti = \
  SL_CLI_COMMAND(getPti,
                 "Get PTI configuration.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setPrintingEnable = \
  SL_CLI_COMMAND(setPrintingEnable,
                 "Control all printing in RAILtest, except CLI.",
                  "0=Disable [1=Enable]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______________________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______Receive_and_Transmit____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__rx = \
  SL_CLI_COMMAND(rx,
                 "Control receive mode.",
                  "0=Disable [1=Enable]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__rxAt = \
  SL_CLI_COMMAND(rxAt,
                 "Configure scheduled receive.",
                  "startTimeUs" SL_CLI_UNIT_SEPARATOR "'rel'=Relative 'abs'=Absolute" SL_CLI_UNIT_SEPARATOR "endTimeUs" SL_CLI_UNIT_SEPARATOR "'rel'=Relative 'abs'=Absolute" SL_CLI_UNIT_SEPARATOR "rxTransEndSched: [0]/1\n                    [uint8opt] hardEnd: [0]/1" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_STRING, SL_CLI_ARG_UINT32, SL_CLI_ARG_STRING, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRxOptions = \
  SL_CLI_COMMAND(setRxOptions,
                 "Show/Configure receive options (RAIL_RX_OPTIONs).",
                  "rxOptionsValues: bitmask of enabled options" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__tx = \
  SL_CLI_COMMAND(tx,
                 "Transmit packets with current TX options.",
                  "number of packets, 0=continuous until next 'tx 0'" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__txWithOptions = \
  SL_CLI_COMMAND(txWithOptions,
                 "Same tx command. This command is deprecated.",
                  "number of packets, 0=continuous until next 'tx 0'" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__txAfterRx = \
  SL_CLI_COMMAND(txAfterRx,
                 "Schedule a TX with specified delay after each RX.",
                  "delayUs: 0=Disable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configTxOptions = \
  SL_CLI_COMMAND(configTxOptions,
                 "Show/Configure transmit options (RAIL_TX_OPTIONs).",
                  "txOptionsValues: bitmask of enabled options" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setFixedLength = \
  SL_CLI_COMMAND(setFixedLength,
                 "Configure fixed length packet operation.",
                  "fixedLength: payload bytes" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setPower = \
  SL_CLI_COMMAND(setPower,
                 "Set the transmit power. The radio must be IDLE.",
                  "power: deci-dBm unless 'raw' is added" SL_CLI_UNIT_SEPARATOR "'raw'=units are raw power level" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT32, SL_CLI_ARG_STRINGOPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getPower = \
  SL_CLI_COMMAND(getPower,
                 "Get the transmit power in deci-dBm.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setPowerConfig = \
  SL_CLI_COMMAND(setPowerConfig,
                 "Set transmit PA configuration. Must use setpower afterwards.",
                  "paMode" SL_CLI_UNIT_SEPARATOR "millivolts" SL_CLI_UNIT_SEPARATOR "rampTimeUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getPowerConfig = \
  SL_CLI_COMMAND(getPowerConfig,
                 "Get the transmit PA configuration.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getPowerLimits = \
  SL_CLI_COMMAND(getPowerLimits,
                 "Get min and max powerLevel for a power mode.",
                  "powerMode" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__enablePaAutoMode = \
  SL_CLI_COMMAND(enablePaAutoMode,
                 "Control automatic PA selection based on the TX power level.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

