Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__configPaAutoMode = \
  SL_CLI_COMMAND(configPaAutoMode,
                 "Configure entries in the default PA Auto Mode plugin.",
                  "start Index" SL_CLI_UNIT_SEPARATOR "min max mode band: PA auto config entries" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_INT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__sweepTxPower = \
  SL_CLI_COMMAND(sweepTxPower,
                 "Sweep TX power for the current PA by toning at each level.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__offsetLqi = \
  SL_CLI_COMMAND(offsetLqi,
                 "Adjust the hardware's LQI value for received packets.",
                  "offset: signed value to add\n                    The resulting LQI is capped within 0..255 range." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getRssi = \
  SL_CLI_COMMAND(getRssi,
                 "Get RSSI in dBm. It'll be invalid if receiver isn't ready.",
                  "[0=don't wait] 1=wait for valid RSSI if possible" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__sweepPower = \
  SL_CLI_COMMAND(sweepPower,
                 "Sweep power by toning low/high in a square wave fashion.",
                  "lowPower: deci-dBm" SL_CLI_UNIT_SEPARATOR "hiPower: deci-dBm" SL_CLI_UNIT_SEPARATOR "periodUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT32, SL_CLI_ARG_INT32, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__startAvgRssi = \
  SL_CLI_COMMAND(startAvgRssi,
                 "Start AGC RSSI averaging.",
                  "averageTimeUs" SL_CLI_UNIT_SEPARATOR "channel: if different than current channel" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT16OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getAvgRssi = \
  SL_CLI_COMMAND(getAvgRssi,
                 "Get AGC RSSI averaging result.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxTone = \
  SL_CLI_COMMAND(setTxTone,
                 "Control tone transmission.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR "antenna: [0]/1\n                    [uint32opt] mode: [0]/1=phaseNoise" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxStream = \
  SL_CLI_COMMAND(setTxStream,
                 "Control stream transmission.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR "streamMode: [1=PN9] 2=1010 3=phaseNoise 0=tone\n                    [uint32opt] antenna: [0]/1" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__status = \
  SL_CLI_COMMAND(getStatus,
                 "Print the current status counters.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__fifoStatus = \
  SL_CLI_COMMAND(fifoStatus,
                 "Print the current FIFO-related counters.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxHoldOff = \
  SL_CLI_COMMAND(setTxHoldOff,
                 "Control transmit hold-off (blocking of transmits).",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxDelay = \
  SL_CLI_COMMAND(setTxDelay,
                 "Set the inter-packet delay for repeated TX.",
                  "delayMilliseconds" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getTxDelay = \
  SL_CLI_COMMAND(getTxDelay,
                 "Get the inter-packet millisecond delay for repeated TX.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxPayload = \
  SL_CLI_COMMAND(setTxPayload,
                 "Set TX packet payload bytes for future transmits.",
                  "offset" SL_CLI_UNIT_SEPARATOR "byte0 byte1 ..." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxRandom = \
  SL_CLI_COMMAND(setTxRandom,
                 "Set a specified range of bytes in the Tx packet payload to a\n                    random value. Call setTxRandom again to stop randomizing the payload.",
                  "Start Index\n                    [uint16opt] End Index" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxPayloadQuiet = \
  SL_CLI_COMMAND(setTxPayloadQuiet,
                 "Like setTxPayload, but less verbose.",
                  "offset" SL_CLI_UNIT_SEPARATOR "byte0 byte1 ..." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxLength = \
  SL_CLI_COMMAND(setTxLength,
                 "Set how much data to load into the TX FIFO for transmitting.\n                    Actual packet length may vary based on radio configuration.",
                  "lengthBytes" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printTxPacket = \
  SL_CLI_COMMAND(printTxPacket,
                 "Print the current TX payload data and byte length.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__peek = \
  SL_CLI_COMMAND(peekRx,
                 "Peek at the start of the receive buffer.",
                  "bytes: 1-10" SL_CLI_UNIT_SEPARATOR "offset: [0]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getTime = \
  SL_CLI_COMMAND(getTime,
                 "Get the current RAIL time in microseconds.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTime = \
  SL_CLI_COMMAND(setTime,
                 "Set the current RAIL time.",
                  "timeUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__dataConfig = \
  SL_CLI_COMMAND(dataConfig,
                 "Control the data methods for TX and RX.",
                  "txMethod: 'pkt'/'fifo'" SL_CLI_UNIT_SEPARATOR "rxMethod: 'pkt'/'fifo'" SL_CLI_UNIT_SEPARATOR "RAIL_RxDataSource_t (>0 needs fifo mode)\n                    [uint8opt] RAIL_TxDataSource_t (>0 needs ping-pong buffer)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_STRING, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRxFifo = \
  SL_CLI_COMMAND(setRxFifo,
                 "Set the receive buffer length.",
                  "lengthBytes: range 64-RX_BUFFER_SIZE" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxFifoThreshold = \
  SL_CLI_COMMAND(setTxFifoThreshold,
                 "Set the TX FIFO Almost Empty threshold.",
                  "thresholdBytes: below which the event triggers" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRxFifoThreshold = \
  SL_CLI_COMMAND(setRxFifoThreshold,
                 "Set the RX FIFO Almost Full threshold.",
                  "thresholdBytes: above which the event triggers" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

