Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__fifoModeTestOptions = \
  SL_CLI_COMMAND(fifoModeTestOptions,
                 "Manual control over RAILtest FIFO actions.",
                  "txFifo: 1=Manual 0=Automatic" SL_CLI_UNIT_SEPARATOR "rxFifo: 1=Manual 0=Automatic" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__rxFifoManualRead = \
  SL_CLI_COMMAND(rxFifoManualRead,
                 "Read and print bytes from receive FIFO when in manual mode.",
                  "appendedInfo: 1=include packet metadata" SL_CLI_UNIT_SEPARATOR "bytesToRead" SL_CLI_UNIT_SEPARATOR "[0=don't] 1=show timestamps with appendedInfo" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__txFifoManualLoad = \
  SL_CLI_COMMAND(txFifoManualLoad,
                 "Try to load data into available TX FIFO space.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__fifoReset = \
  SL_CLI_COMMAND(fifoReset,
                 "Reset the transmit and/or receive FIFO.",
                  "tx: 1=reset TX FIFO" SL_CLI_UNIT_SEPARATOR "rx: 1=reset RX FIFO" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__abortRxPacket = \
  SL_CLI_COMMAND(abortRxPacket,
                 "Idle the radio shortly after RX sync word detection.",
                  "abortOffsetUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printTxAcks = \
  SL_CLI_COMMAND(printTxAcks,
                 "Control printing of TX ACK packets.",
                  "[0=Disable] 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configRxHopping = \
  SL_CLI_COMMAND(configRxChannelHopping,
                 "Configure an RX Channel Hopping sequence.",
                  "channel hopMode param delayUs: a hop's config,\n                                repeat for additional hops ...\n                    Use no arguments to get Z-Wave radio config defaults." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__enableRxHopping = \
  SL_CLI_COMMAND(enableRxChannelHopping,
                 "Control RX channel hopping previously configured.",
                  "[0=Disable] 1=Enable" SL_CLI_UNIT_SEPARATOR "[0=Continue] 1=Restart sequence" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configRxHoppingOpts = \
  SL_CLI_COMMAND(configChannelHoppingOptions,
                 "Configure options for a hop. Use configRxHopping after.",
                  "hopIndex" SL_CLI_UNIT_SEPARATOR "options" SL_CLI_UNIT_SEPARATOR "rssiThreshold: dBm for the threshold option" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_INT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configRxMultiHop = \
  SL_CLI_COMMAND(configChannelHoppingMulti,
                 "Configure multi-sense for a hop. Use configRxHopping after.",
                  "hopIndex" SL_CLI_UNIT_SEPARATOR "syncDetectUs" SL_CLI_UNIT_SEPARATOR "preambleSenseUs" SL_CLI_UNIT_SEPARATOR "timingSenseUs" SL_CLI_UNIT_SEPARATOR "timingReSenseUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getRxHoppingRssi = \
  SL_CLI_COMMAND(getChannelHoppingRssi,
                 "Get the latest RSSI for a hopping channel.",
                  "hopIndex" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__spectrumAnalyzer = \
  SL_CLI_COMMAND(spectrumAnalyzer,
                 "Hop across a channel range to see the RSSI distribution.",
                  "1=Show ASCII-Art graph (non-parseable output)" SL_CLI_UNIT_SEPARATOR "minChannel: [0]-65535\n                    [uint16opt] maxChannel: 0-[65535]\n                    Channel range is limited by the PHY and by hopping's\n                    MAX_NUMBER_CHANNELS." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configRxDutyCycle = \
  SL_CLI_COMMAND(configRxDutyCycle,
                 "Configure RX Duty Cycling of the receiver.",
                  "hopMode" SL_CLI_UNIT_SEPARATOR "parameter(s) {syncUs preamUs timingUs retimingUs}" SL_CLI_UNIT_SEPARATOR "delayUs" SL_CLI_UNIT_SEPARATOR "options\n                    [int32opt] rssiThreshold: dBm for the threshold option" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_INT32, SL_CLI_ARG_INT32, SL_CLI_ARG_INT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__enableRxDutyCycle = \
  SL_CLI_COMMAND(enableRxDutyCycle,
                 "Control RX duty cycling previously configured.",
                  "DutyCycling: 0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR "ScheduledWakeup: [0=Disable] 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getDefaultRxDutyCycleConfig = \
  SL_CLI_COMMAND(getDefaultRxDutyCycleConfig,
                 " Get the default RX duty cycle configuration.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxAltPreambleLen = \
  SL_CLI_COMMAND(setTxAltPreambleLen,
                 "Set alternate TX preamble length, enabled via txOptions.",
                  "preambleBits" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configSyncWords = \
  SL_CLI_COMMAND(configSyncWords,
                 "Set sync words and their length. The radio must be off.",
                  "bits: 2-32" SL_CLI_UNIT_SEPARATOR "syncWord1" SL_CLI_UNIT_SEPARATOR "syncWord2: [same as syncWord1]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getSyncWords = \
  SL_CLI_COMMAND(getSyncWords,
                 "Get the sync word length in bits and value(s).",
                  "",
                 {SL_CLI_ARG_END, });

