Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__printRxErrors = \
  SL_CLI_COMMAND(printRxErrors,
                 "Control printing of RX error packets.",
                  "[0=Disable] 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printRxFreqOffsets = \
  SL_CLI_COMMAND(printRxFreqOffsets,
                 "Control printing of RX frequency offsets.",
                  "[0=Disable] 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printDataRates = \
  SL_CLI_COMMAND(printDataRates,
                 "Print the data rates of the current PHY.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__stopInfinitePream = \
  SL_CLI_COMMAND(stopInfinitePreambleTx,
                 "Stops an infinite preamble transmission.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_____________________________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______Energy_Modes_and_RF_Sensing____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__sleep = \
  SL_CLI_COMMAND(sleep,
                 "Sleep until UART input or RF Sensed (if either configured).",
                  "energyMode: 0-4[hs], for EM1P use 2 with radio on" SL_CLI_UNIT_SEPARATOR "Legacy: RfSenseUs\n                                        RfBand: 0=none,1=GHz,2=MHz,3=both\n                          or Selective: SyncwordBytes Syncword RfBand" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__rfsense = \
  SL_CLI_COMMAND(rfSense,
                 "Start RfSensing.",
                  "Legacy: RfSenseUs; Selective: SyncwordBytes" SL_CLI_UNIT_SEPARATOR "Legacy: RfBand: 0=none,1=GHz,2=MHz,3=both\n                          or Selective: Syncword RfBand: as above" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configRfSenseWakeup = \
  SL_CLI_COMMAND(configRfSenseSelectiveOokWakeupPhy,
                 "Configure RFSense Selective Wakeup PHY for transmitting.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRfSenseTxPayload = \
  SL_CLI_COMMAND(setRfSenseTxPayload,
                 "Load TX FIFO with RfSense Selective(OOK) Mode wake packet.",
                  "syncwordNumBytes: 1-4" SL_CLI_UNIT_SEPARATOR "syncWord: sent from least to most significant byte" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd___________________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______Address_Filtering____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configAddressFilter = \
  SL_CLI_COMMAND(setAddressFilterConfig,
                 "Configure the addresss filter.",
                  "matchTable" SL_CLI_UNIT_SEPARATOR "offset0 size0 offset1 size1 ...\n                    Enter more offsets and sizes if required." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setAddressFiltering = \
  SL_CLI_COMMAND(setAddressFilter,
                 "Control address filtering.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getAddressFiltering = \
  SL_CLI_COMMAND(getAddressFilter,
                 "Get the current state of address filtering.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printAddresses = \
  SL_CLI_COMMAND(printAddresses,
                 "Print the current address filtering addresses.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setAddress = \
  SL_CLI_COMMAND(setAddress,
                 "Set a specific filtering address value.",
                  "field: 0-1" SL_CLI_UNIT_SEPARATOR "filterIndex: 0-3" SL_CLI_UNIT_SEPARATOR "addrByte0 addrByte1 ... addrByte7" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setAddressMask = \
  SL_CLI_COMMAND(setAddressMask,
                 "Set a specific filtering address mask.",
                  "field: 0-1" SL_CLI_UNIT_SEPARATOR "bitMask" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setAddressEnable = \
  SL_CLI_COMMAND(enableAddress,
                 "Control address filtering for a specific address.",
                  "field: 0-1" SL_CLI_UNIT_SEPARATOR "filterIndex: 0-3" SL_CLI_UNIT_SEPARATOR "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd____________________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______Error_Rate_Testing____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

