Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__perRx = \
  SL_CLI_COMMAND(startPerMode,
                 "Start a Packet Error Rate test. 'perRx 0 0' stops test.",
                  "number of packets" SL_CLI_UNIT_SEPARATOR "delayUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__perStatus = \
  SL_CLI_COMMAND(getPerStats,
                 "Get the PER test results. Also see status command.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setBerConfig = \
  SL_CLI_COMMAND(berConfigSet,
                 "Set number of bytes to receive in BER mode.",
                  "number of bytes: 0=maximum (536870911)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__berRx = \
  SL_CLI_COMMAND(berRx,
                 "Control BER receive mode.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__berStatus = \
  SL_CLI_COMMAND(berStatusGet,
                 "Get status of current or last BER test.\n                    Status is reset by setBerConfig and berRx enable.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd________________________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______Listen_Before_Talk_LBT____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setLbtMode = \
  SL_CLI_COMMAND(setLbtMode,
                 "Show/Set the LBT mode for transmits.",
                  "'off'/'csma'/'lbt'" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRINGOPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getLbtParams = \
  SL_CLI_COMMAND(getLbtParams,
                 "Get the current LBT parameters.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setLbtParams = \
  SL_CLI_COMMAND(setLbtParams,
                 "Set LBT parameters.",
                  "minBo" SL_CLI_UNIT_SEPARATOR "maxBo" SL_CLI_UNIT_SEPARATOR "tries" SL_CLI_UNIT_SEPARATOR "ccaThreshold" SL_CLI_UNIT_SEPARATOR "backoffUs" SL_CLI_UNIT_SEPARATOR "durationUs" SL_CLI_UNIT_SEPARATOR "timeoutUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_INT32, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set802154CcaMode = \
  SL_CLI_COMMAND(set802154CcaMode,
                 "Set 802.15.4 CCA Mode",
                  "ccaMode 0=RSSI 1=Signal 2=RSSI|Signal 3=RSSI&Signal 4=Always transmit" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_______________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______802_15_4_Mode____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__enable802154 = \
  SL_CLI_COMMAND(ieee802154Enable,
                 "Configure and enable 802.15.4 mode.",
                  "defaultState: 'idle'/'rx'" SL_CLI_UNIT_SEPARATOR "idleToRxUs" SL_CLI_UNIT_SEPARATOR "turnaroundTimeUs" SL_CLI_UNIT_SEPARATOR "ackTimeoutUs: to ACK's sync-detect" SL_CLI_UNIT_SEPARATOR "defaultFP: [0]/1 Frame Pending for poll ACKs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_INT16, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__config2p4GHz802154 = \
  SL_CLI_COMMAND(config2p4Ghz802154,
                 "Configure the radio for 2.4 GHz 802.15.4.\n                    Use with enable802154.",
                  "antDiv: [0=Disable] 1=Enable\n                    [uint8opt] coex: [0=Disable] 1=Enable\n                    [uint8opt] fem: [0=Disable] 1=Enable\n                    [uint8opt] custom: [0=None] 1=Custom1\n                    [uint8opt] 2mbps: [0=Disable] 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__config863MHz802154 = \
  SL_CLI_COMMAND(config863Mhz802154,
                 "Configure the radio for 863 MHz 802.15.4 GB868.\n                    Use with enable802154.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__config915MHz802154 = \
  SL_CLI_COMMAND(config915Mhz802154,
                 "Configure the radio for 915 MHz 802.15.4 GB868.\n                    Use with enable802154.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set802154e = \
  SL_CLI_COMMAND(ieee802154SetE,
                 "Configure 802.15.4E options.",
                  "RAIL_IEEE802154_EOptions_t" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set802154g = \
  SL_CLI_COMMAND(ieee802154SetG,
                 "Configure 802.15.4G options.",
                  "RAIL_IEEE802154_GOptions_t" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set802154FpMode = \
  SL_CLI_COMMAND(ieee802154SetFpMode,
                 "Control early and data frame pending lookup.",
                  "early:     [0=Disable] 1=Enable" SL_CLI_UNIT_SEPARATOR "dataframes:[0=Disable] 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__acceptFrames = \
  SL_CLI_COMMAND(ieee802154AcceptFrames,
                 "Control 802.15.4 frame type acceptance.",
                  "command: 0=Reject [1=Accept]" SL_CLI_UNIT_SEPARATOR "ack:    [0=Reject] 1=Accept" SL_CLI_UNIT_SEPARATOR "data:    0=Reject [1=Accept]" SL_CLI_UNIT_SEPARATOR "beacon:  0=Reject [1=Accept]" SL_CLI_UNIT_SEPARATOR "multipurpose: [0=Reject] 1=Accept" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setPromiscuousMode = \
  SL_CLI_COMMAND(ieee802154SetPromiscuousMode,
                 "Control promiscuous mode.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRxToEnhAckTx = \
  SL_CLI_COMMAND(setRxToEnhAckTx,
                 "Set an RxToTx turnaround time used just for Enh-ACKs.",
                  "rxToTxUs (0=same as Imm-ACKs, -1=don't change)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT32, SL_CLI_ARG_END, });

