Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__setPanCoordinator = \
  SL_CLI_COMMAND(ieee802154SetPanCoordinator,
                 "Control whether node is a PAN coordinator.",
                  "1=Yes 0=No" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setPanId802154 = \
  SL_CLI_COMMAND(ieee802154SetPanId,
                 "Set the PAN ID for a filtering index.",
                  "panId" SL_CLI_UNIT_SEPARATOR "filterIndex: [0]-2" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setShortAddr802154 = \
  SL_CLI_COMMAND(ieee802154SetShortAddress,
                 "Set the short address for a filtering index.",
                  "shortAddr" SL_CLI_UNIT_SEPARATOR "filterIndex: [0]-2" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setLongAddr802154 = \
  SL_CLI_COMMAND(ieee802154SetLongAddress,
                 "Set the long address for a filtering index.",
                  "longAddr_0" SL_CLI_UNIT_SEPARATOR "longAddr_1" SL_CLI_UNIT_SEPARATOR "longAddr_2" SL_CLI_UNIT_SEPARATOR "longAddr_3" SL_CLI_UNIT_SEPARATOR "longAddr_4" SL_CLI_UNIT_SEPARATOR "longAddr_5" SL_CLI_UNIT_SEPARATOR "longAddr_6" SL_CLI_UNIT_SEPARATOR "longAddr_7" SL_CLI_UNIT_SEPARATOR "filterIndex: [0]-2" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setAddresses802154 = \
  SL_CLI_COMMAND(ieee802154SetAddresses,
                 "Set all 802.15.4 address information.",
                  "panId0" SL_CLI_UNIT_SEPARATOR "shortAddr0" SL_CLI_UNIT_SEPARATOR "longAddr0\n                    [stringopt] panId1 shortAddr1 longAddr1 ..." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_STRINGOPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configRxChannelSwitching802154 = \
  SL_CLI_COMMAND(ieee802154ConfigRxChannelSwitching,
                 " Configure RX channel switching for 2.4 GHz 802.15.4",
                  "First radio channel" SL_CLI_UNIT_SEPARATOR "Second radio channel" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setDataReqLatency = \
  SL_CLI_COMMAND(ieee802154SetDataReqLatency,
                 "Set data request event processing latency.",
                  "latencyUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set802154PHR = \
  SL_CLI_COMMAND(ieee802154SetPHR,
                 "Set PHR (first 1, 2 or 4 bytes) in Tx buffer according to\n                      the 'format' input parameter.\n                    PHR 'frameLength' field is derived from TxLength set\n                      previously with 'setTxLength'\n                    For PHR fields info, refer to 802.15.4 specification.",
                  "PHR format: 0=misc IEEE802154 modulations, PHR 1byte\n                                        1=SUN FSK, PHR 2bytes\n                                        2=SUN OFDM, PHR 4bytes\n                                        3=SUN OQPSK, PHR 4bytes" SL_CLI_UNIT_SEPARATOR "For LEG_OQPSK: none\n                               For SUN_FSK  : fcsTtype\n                               For SUN_OFDM : rate\n                               For SUN_OQPSK: spreadingMode\n                    [uint8opt] For LEG_OQPSK: none\n                               For SUN_FSK  : whitening\n                               For SUN_OFDM : scrambler\n                               For SUN_OQPSK: rateMode" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__trigModeSwitchTx = \
  SL_CLI_COMMAND(trigModeSwitchTx,
                 "Transmit a Mode Switch packet then transmit packets on the new PHY with current\n                    TX options Depending on modeSwitchLife configuration, after all iterations are\n                    done, it either stays on the new PHY or returns to the base PHY.",
                  "new PhyModeId, i.e. ID of the PHYMode we are switching to" SL_CLI_UNIT_SEPARATOR "number of packets transmitted on the new PHY" SL_CLI_UNIT_SEPARATOR "number of times the sequence -mode switch packet followed by data packets- is\n                    repeated, default is 1 if argument is absent\n                    [uint32opt] delayMilliseconds before switching back to base PHY after all packets have been\n                    transmitted on the new PHY, default is 0 if argument is absent. Multitimer is\n                    used for delay greater than 0." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__modeSwitchLife = \
  SL_CLI_COMMAND(modeSwitchLife,
                 "Return to the base PHY after all data packets transmission for TX or after\n                    MODE_SWITCH_START event and multitimer expiration after first data packet\n                    reception on new phy for RX.",
                  "0=stay on new PHY (normal Wi-SUN FAN behaviour) 1=return to base PHY (special test mode)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______BLE_Mode____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

