Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__setBleMode = \
  SL_CLI_COMMAND(bleEnable,
                 "Control BLE mode.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getBleMode = \
  SL_CLI_COMMAND(bleStatus,
                 "Get the current BLE mode.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setBleChannelParams = \
  SL_CLI_COMMAND(bleSetChannelParams,
                 "Configure channel parameters related to BLE.",
                  "logicalChannel" SL_CLI_UNIT_SEPARATOR "accessAddr crcInit disableWhiten" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setBlePhySwitchToRx = \
  SL_CLI_COMMAND(blePhySwitchToRx,
                 "Configure BLE PhySwitchToRx parameters. RX is\n                    entered timeDeltaUs after sync word of received packet.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR "phy timeDelta physicalChannel\n                    [uint32opt] logicalChannel accessAddr crcInit\n                    [uint32opt] disableWhiten\n                    [uint32opt] extraDelayUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setBleAdvertising = \
  SL_CLI_COMMAND(bleAdvertisingConfig,
                 "Configure for BLE advertising.",
                  "advChannel: 37-39" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setBle1Mbps = \
  SL_CLI_COMMAND(bleSet1MbpsPhy,
                 "Switch to the 1Mbps BLE PHY.",
                  "0=Legacy 1=Viterbi [chip default]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setBle2Mbps = \
  SL_CLI_COMMAND(bleSet2MbpsPhy,
                 "Switch to the 2Mbps BLE PHY.",
                  "0=Legacy 1=Viterbi [chip default]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setBleCoding = \
  SL_CLI_COMMAND(bleSetCoding,
                 "Switch to a BLE coded PHY.",
                  "RAIL_BLE_Coding_t value" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setBleSimulscan = \
  SL_CLI_COMMAND(bleSetSimulscan,
                 "Switch to a BLE simulscan PHY.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_____________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______WMBUS_Mode____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configWmbus = \
  SL_CLI_COMMAND(configWmbus,
                 "Configure WMBUS simultaneous M2O RX of T and C modes",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______Z_Wave_Mode____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setZWaveMode = \
  SL_CLI_COMMAND(zwaveEnable,
                 "Show/Control Z-Wave mode.",
                  "0=Disable 1=Enable\n                    [uint8opt] optionsBitmask" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getZWaveMode = \
  SL_CLI_COMMAND(zwaveStatus,
                 "Get the current Z-Wave mode.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setZWaveRegion = \
  SL_CLI_COMMAND(zwaveSetRegion,
                 "Set the Z-Wave region.",
                  "region: see listZWaveRegions" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__performZwaveIrcal = \
  SL_CLI_COMMAND(zwavePerformIrcal,
                 "Perform IRCAL across all channels of the current Z-Wave region.",
                  "[0=Use cached IRCAL values], 1=Force IRCAL" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getZWaveRegion = \
  SL_CLI_COMMAND(zwaveGetRegion,
                 "Get the current Z-Wave region.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__listZWaveRegions = \
  SL_CLI_COMMAND(zwaveListRegions,
                 "List supported Z-Wave regions.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getZWaveBaudRate = \
  SL_CLI_COMMAND(zwaveGetBaudRate,
                 "Get the baudrate of the current Z-Wave channel.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setZWaveNodeId = \
  SL_CLI_COMMAND(zwaveSetNodeId,
                 "Sets Z-Wave NodeId.",
                  "nodeId" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setZWaveHomeId = \
  SL_CLI_COMMAND(zwaveSetHomeId,
                 "Sets Z-Wave HomeId and its hash.",
                  "homeId" SL_CLI_UNIT_SEPARATOR "hash" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setZWaveOptions = \
  SL_CLI_COMMAND(zwaveConfigureOptions,
                 "Configure Z-Wave options.",
                  "optionsBitmask" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setZWaveLowPower = \
  SL_CLI_COMMAND(zwaveSetLowPowerLevel,
                 "Set the transmit power for low-power ACKing.",
                  "power: deci-dBm unless 'raw' is added" SL_CLI_UNIT_SEPARATOR "'raw'=units are raw power level" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT32, SL_CLI_ARG_STRINGOPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getZWaveLowPower = \
  SL_CLI_COMMAND(zwaveGetLowPowerLevel,
                 "Get the low power values (deci-dBm and raw).",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__zwaveReceiveBeam = \
  SL_CLI_COMMAND(zwaveReceiveBeam,
                 "Run the Z-Wave beam detection algorithm.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setMfmMode = \
  SL_CLI_COMMAND(mfmEnable,
                 "Set MFM mode to enabled or disabled",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

