Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__getMfmMode = \
  SL_CLI_COMMAND(mfmStatus,
                 "Get the current MFM mod",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd____________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______RAIL_Timer____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTimer = \
  SL_CLI_COMMAND(setTimer,
                 "Set the RAIL timer timeout.",
                  "timeout: per mode" SL_CLI_UNIT_SEPARATOR "'rel'=Relative 'abs'=Absolute" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_STRING, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__timerCancel = \
  SL_CLI_COMMAND(timerCancel,
                 "Cancel the RAIL timer if it is active.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printTimerStats = \
  SL_CLI_COMMAND(printTimerStats,
                 "Print current timer configuration.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__enableMultiTimer = \
  SL_CLI_COMMAND(enableMultiTimer,
                 "Control the multiTimer API.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setMultiTimer = \
  SL_CLI_COMMAND(setMultiTimer,
                 "Set a specific timer timeout.",
                  "timer: 0..(NUM_MULTI_TIMERS-1)" SL_CLI_UNIT_SEPARATOR "timeout: per mode" SL_CLI_UNIT_SEPARATOR "'rel'=Relative 'abs'=Absolute" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_STRING, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__multiTimerCancel = \
  SL_CLI_COMMAND(multiTimerCancel,
                 "Cancel a specific timer if it is active.",
                  "timer: 0..(NUM_MULTI_TIMERS-1)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getMultiTimerStats = \
  SL_CLI_COMMAND(printMultiTimerStats,
                 "Get information about a specific timer.",
                  "timer: 0..(NUM_MULTI_TIMERS-1)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__delayUs = \
  SL_CLI_COMMAND(delayUs,
                 "Do a blocking delay for a specified time.",
                  "delayUs" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______Auto_ACK_ing____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__autoAckConfig = \
  SL_CLI_COMMAND(autoAckConfig,
                 "Configure and enable auto-ACK functionality.",
                  "defaultState: 'idle'/'rx'" SL_CLI_UNIT_SEPARATOR "idleToRxUs" SL_CLI_UNIT_SEPARATOR "turnaroundTimeUs" SL_CLI_UNIT_SEPARATOR "ackTimeoutUs: to ACK's sync-detect" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__autoAckDisable = \
  SL_CLI_COMMAND(autoAckDisable,
                 "Disable auto-ACK. Use autoAckConfig to reenable.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setAckPayload = \
  SL_CLI_COMMAND(setAckPayload,
                 "Set the ACK payload to transmit.",
                  "offset" SL_CLI_UNIT_SEPARATOR "byte0 byte1 ..." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setAckLength = \
  SL_CLI_COMMAND(setAckLength,
                 "Set how much data to load into the TXACK FIFO.",
                  "lengthBytes" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printAckPacket = \
  SL_CLI_COMMAND(printAckPacket,
                 "Print the current TXACK payload data and byte length.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getAutoAck = \
  SL_CLI_COMMAND(getAutoAck,
                 "Get the current state of auto-ACKing.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__autoAckPause = \
  SL_CLI_COMMAND(autoAckPause,
                 "Pause or Resume auto-ACKing",
                  "1=PauseRx 0=ResumeRx" SL_CLI_UNIT_SEPARATOR "1=PauseTx 0=ResumeTx" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxAckOptions = \
  SL_CLI_COMMAND(setTxAckOptions,
                 "Control auto-ACK response for just the next receive.",
                  "1=cancelAck 0=sendAck" SL_CLI_UNIT_SEPARATOR "1=useTxBuf 0=useTxAckBuf" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxAckDirect = \
  SL_CLI_COMMAND(setTxAckDirect,
                 "Control direct access to TXACK FIFO (RAIL_GetAutoAckFifo).",
                  "0=indirect-access 1=direct-access" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd________________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

