Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd______GPIO_Functions____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setGpioOutPin = \
  SL_CLI_COMMAND(setGpioOutPin,
                 "Set a GPIO pin data out bit.",
                  "gpioPort: start from '0' or 'a' or 'A'" SL_CLI_UNIT_SEPARATOR "gpioPin" SL_CLI_UNIT_SEPARATOR "state: 0/1" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setAntDivPin = \
  SL_CLI_COMMAND(setAntDivPin,
                 "Set output pin for antenna diversity.",
                  "Antenna0 gpioPort (0=A, 1=B, etc.)" SL_CLI_UNIT_SEPARATOR "Antenna0 gpioPin" SL_CLI_UNIT_SEPARATOR "Antenna1 gpioPort (0=A, 1=B, etc.)" SL_CLI_UNIT_SEPARATOR "Antenna1 gpioPin" SL_CLI_UNIT_SEPARATOR "Antenna0 gpioPin State: 0=Disable [1=Enable]\n                    [uint8opt] Antenna1 gpioPin State: 0=Disable [1=Enable]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_____________________________ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd______Diagnostic_and_Test____ = \
  SL_CLI_COMMAND(cliSeparatorHack,
                 "",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getConfigIndex = \
  SL_CLI_COMMAND(getConfigIndex,
                 "Get the index of the current multi-PHY radio config.\n                    See the entries in *channelConfigs[]. Start with index 0.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setConfigIndex = \
  SL_CLI_COMMAND(setConfigIndex,
                 "Activate a multi-PHY radio configuration.\n                    See the entries in *channelConfigs[]. Start with index 0.",
                  "multiPhyIndex" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setCtune = \
  SL_CLI_COMMAND(setCtune,
                 "Set the value of HFXO CTUNE. The radio must be IDLE.",
                  "ctune" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getCtune = \
  SL_CLI_COMMAND(getCtune,
                 "Get the value of HFXO CTUNE",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setCtuneDelta = \
  SL_CLI_COMMAND(setCtuneDelta,
                 "Set the value of HFXO CTUNE delta",
                  "delta" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getCtuneDelta = \
  SL_CLI_COMMAND(getCtuneDelta,
                 "Get the value of HFXO CTUNE delta",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setPaCtune = \
  SL_CLI_COMMAND(setPaCtune,
                 "Set the PACTUNE value for TX and RX.",
                  "txPaCtune" SL_CLI_UNIT_SEPARATOR "rxPaCtune" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__enablePaCal = \
  SL_CLI_COMMAND(enablePaCal,
                 "Control PA power calibration.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setDebugSignal = \
  SL_CLI_COMMAND(setDebugSignal,
                 "Configure chip specific debug output.\n                    Use 'setDebugSignal help me' for more details.",
                  "pin" SL_CLI_UNIT_SEPARATOR "signal" SL_CLI_UNIT_SEPARATOR "signalOptions" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_STRING, SL_CLI_ARG_UINT16OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setDebugMode = \
  SL_CLI_COMMAND(setDebugMode,
                 "Control Debug mode which allows freqOverride.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__freqOverride = \
  SL_CLI_COMMAND(setFrequency,
                 "Set the radio frequency. Requires debug mode.",
                  "freqHz: Only small deviations from the\n                                     current configuration are supported." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configDirectMode = \
  SL_CLI_COMMAND(configDirectMode,
                 "Configure direct mode",
                  "syncRx: 0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR "syncTx: 0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR "doutPort" SL_CLI_UNIT_SEPARATOR "doutPin" SL_CLI_UNIT_SEPARATOR "dclkPort" SL_CLI_UNIT_SEPARATOR "dclkPin" SL_CLI_UNIT_SEPARATOR "dinPort" SL_CLI_UNIT_SEPARATOR "dinPin" SL_CLI_UNIT_SEPARATOR "doutLoc\n                    [uint8opt] dclkLoc\n                    [uint8opt] dinLoc" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__directMode = \
  SL_CLI_COMMAND(setDirectMode,
                 "Control direct mode.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__directTx = \
  SL_CLI_COMMAND(setDirectTx,
                 "Control TX in direct mode.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

