Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__txCancel = \
  SL_CLI_COMMAND(txCancel,
                 "Start a TX that will be cancelled.",
                  "delayUs: when to cancel it" SL_CLI_UNIT_SEPARATOR "stopMode: [0=RAIL_IDLE_ABORT] 1-3=RAIL_StopMode_t\n                                         4-7=4+RAIL_IdleMode_t" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT32, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configHFXOThermistor = \
  SL_CLI_COMMAND(configHFXOThermistor,
                 " Configures the thermistor pin and the HFXO compensation parameters.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__startThermistor = \
  SL_CLI_COMMAND(startThermistorMeasurement,
                 "Starts a thermistor measurement.\n                    Triggers the HFXO temperature compensation if enabled.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getThermistor = \
  SL_CLI_COMMAND(getThermistorImpedance,
                 "Gets the thermistor impedance.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getRandom = \
  SL_CLI_COMMAND(getRandom,
                 "Get random data from the radio.",
                  "lengthBytes" SL_CLI_UNIT_SEPARATOR "[0=show them] 1=hide them" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxUnderflow = \
  SL_CLI_COMMAND(setTxUnderflow,
                 "Control TX underflows by not loading the TX FIFO.",
                  "1=Force underflows 0=Disable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRxOverflow = \
  SL_CLI_COMMAND(setRxOverflow,
                 "Control RX overflows by delaying in the event handler.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR "delayUs: [0]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setCalibrations = \
  SL_CLI_COMMAND(setCalibrations,
                 "Control calibrations.",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxTransitions = \
  SL_CLI_COMMAND(setTxTransitions,
                 "Set the TX state transitions.",
                  "txSuccess: 'idle'/'rx'" SL_CLI_UNIT_SEPARATOR "txError: 'idle'/'rx'" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_STRING, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRxTransitions = \
  SL_CLI_COMMAND(setRxTransitions,
                 "Set the RX state transitions.",
                  "rxSuccess: 'idle'/'rx'/'tx'" SL_CLI_UNIT_SEPARATOR "rxError: 'idle'/'rx'/'tx'" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_STRING, SL_CLI_ARG_STRING, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getTxTransitions = \
  SL_CLI_COMMAND(getTxTransitions,
                 "Get the TX state transitions.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getRxTransitions = \
  SL_CLI_COMMAND(getRxTransitions,
                 "Get the RX state transitions.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setNextTxRepeat = \
  SL_CLI_COMMAND(setNextTxRepeat,
                 "Set next transmit's automatic repeat count.",
                  "number of auto-repeated transmits after the first" SL_CLI_UNIT_SEPARATOR "delayUs inter-transmit or hop delay\n                    [uint32opt] channel (if hopping)\n                    repeat delayUs and channel for additional hops." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__configTxRepeatStartToStart = \
  SL_CLI_COMMAND(configTxRepeatStartToStart,
                 "Set tx repeat option to have tx repeats delaying from start of tx to start of tx.",
                  "0 to disable, 1 to enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setNextBleTxRepeat = \
  SL_CLI_COMMAND(setNextBleTxRepeat,
                 "Set next transmit's automatic repeat count.",
                  "number of auto-repeated transmits after the first" SL_CLI_UNIT_SEPARATOR "delayUs inter-transmit or hop delay\n                    [uint32opt] phy railChannel logicalChannel accessAddress\n                    (a hop's config, repeat from delayUs for additional hops)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTxTimePos = \
  SL_CLI_COMMAND(setTxTimePos,
                 "Set desired TX timestamp position.",
                  "RAIL_PacketTimePosition_t" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRxTimePos = \
  SL_CLI_COMMAND(setRxTimePos,
                 "Set desired RX timestamp position.",
                  "RAIL_PacketTimePosition_t" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setTimings = \
  SL_CLI_COMMAND(setTimings,
                 "Set RAIL state transition timings (use -1 to keep same).",
                  "idleToRxUs" SL_CLI_UNIT_SEPARATOR "txToRxUs" SL_CLI_UNIT_SEPARATOR "idleToTxUs" SL_CLI_UNIT_SEPARATOR "rxToTxUs [0]\n                    [int32opt] rxSearchTimeoutUs [0]\n                    [int32opt] txToRxSearchTimeout [0]\n                    [int32opt] txToTx [0]" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT32, SL_CLI_ARG_INT32, SL_CLI_ARG_INT32, SL_CLI_ARG_INT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__forceAssert = \
  SL_CLI_COMMAND(forceAssert,
                 "Force a RAIL assert with the given error code.",
                  "RAIL_AssertErrorCodes_t" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getAppMode = \
  SL_CLI_COMMAND(getAppMode,
                 "Get the current RAILtest AppMode_t mode.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getRadioState = \
  SL_CLI_COMMAND(getRadioState,
                 "Get the current RAIL_RadioState_t radio state.",
                  "",
                 {SL_CLI_ARG_END, });

