Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__verifyRadio = \
  SL_CLI_COMMAND(verifyRadio,
                 "Verify radio memory contents.",
                  "durationUs: time limit" SL_CLI_UNIT_SEPARATOR "0=Resume if previously didn't finish 1=Restart" SL_CLI_UNIT_SEPARATOR "0=current radio config 1=external radio config" SL_CLI_UNIT_SEPARATOR "0=No callback 1=Use RAILCb_ConfigVerification" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getChannel = \
  SL_CLI_COMMAND(getChannel,
                 "Get the current radio channel.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setChannel = \
  SL_CLI_COMMAND(setChannel,
                 "Set the radio channel.",
                  "channel" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setPktOffsetInTxFifo = \
  SL_CLI_COMMAND(setPktOffsetInTxFifo,
                 " Set the offset in number of bytes of the Tx Data in Tx Fifo.",
                  "Offset in number of  bytes. If no parameter specified, command returns current active Offset" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__reset = \
  SL_CLI_COMMAND(resetChip,
                 "Perform a reboot of the chip.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__writeRmrStructure = \
  SL_CLI_COMMAND(CI_writeRmrStructure,
                 "Reserved for Simplicity Studio use only.",
                  "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__updateConfigPtr = \
  SL_CLI_COMMAND(CI_updateConfigurationPointer,
                 "Reserved for Simplicity Studio use only.",
                  "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__reconfigureModem = \
  SL_CLI_COMMAND(CI_reconfigureModem,
                 "Reserved for Simplicity Studio use only.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRfPath = \
  SL_CLI_COMMAND(CI_SetRfPath,
                 "Set the RF path.",
                  "0=Path0 1=Path1" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printEvents = \
  SL_CLI_COMMAND(configPrintEvents,
                 "Show/Configure printing of RAIL events as they occur.",
                  "printEvents<31:0> printEvents<63:32>\n                    [uint32opt] mask<31:0> mask<63:32>" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printChipFeatures = \
  SL_CLI_COMMAND(printChipFeatures,
                 "Display RAIL features supported at compile and runtime.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getmemw = \
  SL_CLI_COMMAND(getMemWord,
                 "Read count 32-bit words starting at address.",
                  "address" SL_CLI_UNIT_SEPARATOR "count" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setmemw = \
  SL_CLI_COMMAND(setMemWord,
                 "Write 32-bit values starting at address.",
                  "address" SL_CLI_UNIT_SEPARATOR "value0 value1 ..." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__throughput = \
  SL_CLI_COMMAND(throughput,
                 "Throughput test.",
                  "number of packets" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRssiOffset = \
  SL_CLI_COMMAND(setRssiOffset,
                 "Sets the RSSI offset.",
                  "offsetDbm" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getRssiOffset = \
  SL_CLI_COMMAND(getRssiOffset,
                 "Gets the RSSI offset(s) in dBm.",
                  "[0=radio and protocol-specific] 1=radio only" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRssiDetectThreshold = \
  SL_CLI_COMMAND(setRssiDetectThreshold,
                 "Sets the RSSI detect threshold.",
                  "RSSI detect threshold (in dBm). (-128 disables detection)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getRssiDetectThreshold = \
  SL_CLI_COMMAND(getRssiDetectThreshold,
                 "Gets the RSSI detect threshold(in dBm).",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__txAt = \
  SL_CLI_COMMAND(txAtTime,
                 "Transmit a packet at a certain time.",
                  "time: per mode" SL_CLI_UNIT_SEPARATOR "['abs'=Absolute] 'rel'=Relative\n                    [stringopt] 'abort' RX if TX occurs during packet RX\n                                    otherwise TX is delayed to end of RX" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_STRINGOPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setFreqOffset = \
  SL_CLI_COMMAND(setFreqOffset,
                 "Get/Set the frequency offset adjustment.",
                  "RAIL_FrequencyOffset_t" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT32OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__holdRx = \
  SL_CLI_COMMAND(holdRx,
                 "Control holding of received packets.",
                  "[0=Process packets immediately] 1=Hold packets" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__wait = \
  SL_CLI_COMMAND(wait,
                 "Suspend processing of CLI input for a while.",
                  "waitTimeUs" SL_CLI_UNIT_SEPARATOR "['rel'=Relative] 'abs'=Absolute" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_STRINGOPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__clearScript = \
  SL_CLI_COMMAND(clearScript,
                 "Clear the script entered via enterScript.",
                  "[0=RAM] 1=Flash" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__printScript = \
  SL_CLI_COMMAND(printScript,
                 "Print the script entered via enterScript.",
                  "[0=RAM] 1=Flash" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__enterScript = \
  SL_CLI_COMMAND(enterScript,
                 "Enter script entry mode.\n                    Conclude entry mode with text 'endScript'.",
                  "[0=RAM] 1=Flash-script will run on boot" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__runScript = \
  SL_CLI_COMMAND(runScript,
                 "Run the script entered via enterScript.",
                  "[0=RAM] 1=Flash-script will run on boot" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8OPT, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__setRetimeOption = \
  SL_CLI_COMMAND(setRetimeOption,
                 "Control retime options.",
                  "optionBitMask: 1=HFXO | 2=HFRCO | 4=DCDC | 8=LCD" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__enable802154SignalIdentifier = \
  SL_CLI_COMMAND(enable802154SignalIdentifier,
                 " Enable Signal Identifier 2.4Ghz 802.15.4 signal detection",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

