Thanhnt-64/-ATN_20231/contiki-ng/arch/cpu/gecko/mgm240pb32vnn/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd__enableBleSignalIdentifier = \
  SL_CLI_COMMAND(enableBleSignalIdentifier,
                 " Enable Signal Identifier for BLE signal detection",
                  "Mode 0=Disable 1=BLE1Mbps 2=BLE2Mbps" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__getChannelConfigEntry = \
  SL_CLI_COMMAND(getChannelConfigEntry,
                 "   Get the maximum valid channelConfig index, the maximum\n                    valid channelConfigEntry index in the selected channelConfig\n                    and the parameters of the selected channelConfigEntry",
                  "channelConfig index" SL_CLI_UNIT_SEPARATOR "channelConfigEntry index" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__deinitProtocol = \
  SL_CLI_COMMAND(deinitProtocol,
                 "Deinit the current protocol (BLE, 802.15.4, Z-Wave)",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__enableCacheSynthCal = \
  SL_CLI_COMMAND(enableCacheSynthCal,
                 "Sequencer will start caching the calibration values on next\n                    state transition and use them instead of calibrating again\n                    for future state transitions. Recalibration will occur when\n                    needed (eg. protocol change, temperature change)",
                  "0=Disable 1=Enable" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });


// Create group command tables and structs if cli_groups given
// in template. Group name is suffixed with _group_table for tables
// and group commands are cli_cmd_grp_( group name )
// Create root command table
const sl_cli_command_entry_t sl_cli_default_command_table[] = {
  { "_________________________________", &cli_cmd___________________________________, false },
  { "____Application_Configuration____", &cli_cmd______Application_Configuration____, false },
  { "setEventConfig", &cli_cmd__setEventConfig, false },
  { "resetCounters", &cli_cmd__resetCounters, false },
  { "setPeripheralEnable", &cli_cmd__setPeripheralEnable, false },
  { "setNotifications", &cli_cmd__setNotifications, false },
  { "getLogLevels", &cli_cmd__getLogLevels, false },
  { "getVersion", &cli_cmd__getVersion, false },
  { "getVersionVerbose", &cli_cmd__getVersionVerbose, false },
  { "setPtiProtocol", &cli_cmd__setPtiProtocol, false },
  { "getPti", &cli_cmd__getPti, false },
  { "setPrintingEnable", &cli_cmd__setPrintingEnable, false },
  { "____________________________", &cli_cmd______________________________, false },
  { "____Receive_and_Transmit____", &cli_cmd______Receive_and_Transmit____, false },
  { "rx", &cli_cmd__rx, false },
  { "r", &cli_cmd__rx, true },
  { "rxAt", &cli_cmd__rxAt, false },
  { "setRxOptions", &cli_cmd__setRxOptions, false },
  { "configRxOptions", &cli_cmd__setRxOptions, true },
  { "tx", &cli_cmd__tx, false },
  { "t", &cli_cmd__tx, true },
  { "txWithOptions", &cli_cmd__txWithOptions, false },
  { "txAfterRx", &cli_cmd__txAfterRx, false },
  { "configTxOptions", &cli_cmd__configTxOptions, false },
  { "setTxOptions", &cli_cmd__configTxOptions, true },
  { "setFixedLength", &cli_cmd__setFixedLength, false },
  { "setPower", &cli_cmd__setPower, false },
  { "getPower", &cli_cmd__getPower, false },
  { "setPowerConfig", &cli_cmd__setPowerConfig, false },
  { "getPowerConfig", &cli_cmd__getPowerConfig, false },
  { "getPowerLimits", &cli_cmd__getPowerLimits, false },
  { "enablePaAutoMode", &cli_cmd__enablePaAutoMode, false },
  { "configPaAutoMode", &cli_cmd__configPaAutoMode, false },
  { "sweepTxPower", &cli_cmd__sweepTxPower, false },
  { "offsetLqi", &cli_cmd__offsetLqi, false },
  { "getRssi", &cli_cmd__getRssi, false },
  { "sweepPower", &cli_cmd__sweepPower, false },
  { "startAvgRssi", &cli_cmd__startAvgRssi, false },
  { "getAvgRssi", &cli_cmd__getAvgRssi, false },
  { "setTxTone", &cli_cmd__setTxTone, false },
  { "setTxStream", &cli_cmd__setTxStream, false },
  { "status", &cli_cmd__status, false },
  { "fifoStatus", &cli_cmd__fifoStatus, false },
  { "setTxHoldOff", &cli_cmd__setTxHoldOff, false },
  { "setTxDelay", &cli_cmd__setTxDelay, false },
  { "getTxDelay", &cli_cmd__getTxDelay, false },
  { "setTxPayload", &cli_cmd__setTxPayload, false },
  { "setTxRandom", &cli_cmd__setTxRandom, false },
  { "setTxPayloadQuiet", &cli_cmd__setTxPayloadQuiet, false },
  { "setTxLength", &cli_cmd__setTxLength, false },
  { "printTxPacket", &cli_cmd__printTxPacket, false },
  { "peek", &cli_cmd__peek, false },
  { "getTime", &cli_cmd__getTime, false },
  { "setTime", &cli_cmd__setTime, false },
  { "dataConfig", &cli_cmd__dataConfig, false },
  { "setRxFifo", &cli_cmd__setRxFifo, false },
  { "setTxFifoThreshold", &cli_cmd__setTxFifoThreshold, false },
  { "setRxFifoThreshold", &cli_cmd__setRxFifoThreshold, false },
  { "fifoModeTestOptions", &cli_cmd__fifoModeTestOptions, false },
  { "rxFifoManualRead", &cli_cmd__rxFifoManualRead, false },
  { "txFifoManualLoad", &cli_cmd__txFifoManualLoad, false },
  { "fifoReset", &cli_cmd__fifoReset, false },
  { "abortRxPacket", &cli_cmd__abortRxPacket, false },
  { "printTxAcks", &cli_cmd__printTxAcks, false },
  { "configRxHopping", &cli_cmd__configRxHopping, false },
  { "configRxChannelHopping", &cli_cmd__configRxHopping, true },
  { "enableRxHopping", &cli_cmd__enableRxHopping, false },
  { "enableRxChannelHopping", &cli_cmd__enableRxHopping, true },
  { "configRxHoppingOpts", &cli_cmd__configRxHoppingOpts, false },
  { "configChannelHoppingOptions", &cli_cmd__configRxHoppingOpts, true },
  { "configRxMultiHop", &cli_cmd__configRxMultiHop, false },
  { "configChannelHoppingMulti", &cli_cmd__configRxMultiHop, true },
  { "getRxHoppingRssi", &cli_cmd__getRxHoppingRssi, false },
  { "getChannelHoppingRssi", &cli_cmd__getRxHoppingRssi, true },
  { "spectrumAnalyzer", &cli_cmd__spectrumAnalyzer, false },
  { "configRxDutyCycle", &cli_cmd__configRxDutyCycle, false },
  { "enableRxDutyCycle", &cli_cmd__enableRxDutyCycle, false },
  { "getDefaultRxDutyCycleConfig", &cli_cmd__getDefaultRxDutyCycleConfig, false },
  { "setTxAltPreambleLen", &cli_cmd__setTxAltPreambleLen, false },
  { "configSyncWords", &cli_cmd__configSyncWords, false },
  { "getSyncWords", &cli_cmd__getSyncWords, false },
  { "printRxErrors", &cli_cmd__printRxErrors, false },
  { "printRxFreqOffsets", &cli_cmd__printRxFreqOffsets, false },
  { "printDataRates", &cli_cmd__printDataRates, false },
  { "stopInfinitePream", &cli_cmd__stopInfinitePream, false },
  { "stopInfinitePreambleTx", &cli_cmd__stopInfinitePream, true },
  { "___________________________________", &cli_cmd_____________________________________, false },
  { "____Energy_Modes_and_RF_Sensing____", &cli_cmd______Energy_Modes_and_RF_Sensing____, false },
  { "sleep", &cli_cmd__sleep, false },
  { "rfsense", &cli_cmd__rfsense, false },
  { "configRfSenseWakeup", &cli_cmd__configRfSenseWakeup, false },
  { "configRfSenseWakeupPhy", &cli_cmd__configRfSenseWakeup, true },
  { "setRfSenseTxPayload", &cli_cmd__setRfSenseTxPayload, false },
  { "_________________________", &cli_cmd___________________________, false },
  { "____Address_Filtering____", &cli_cmd______Address_Filtering____, false },
  { "configAddressFilter", &cli_cmd__configAddressFilter, false },
  { "setAddressFiltering", &cli_cmd__setAddressFiltering, false },
  { "getAddressFiltering", &cli_cmd__getAddressFiltering, false },
  { "printAddresses", &cli_cmd__printAddresses, false },
  { "setAddress", &cli_cmd__setAddress, false },
  { "setAddressMask", &cli_cmd__setAddressMask, false },
  { "setAddressEnable", &cli_cmd__setAddressEnable, false },
  { "__________________________", &cli_cmd____________________________, false },
  { "____Error_Rate_Testing____", &cli_cmd______Error_Rate_Testing____, false },
  { "perRx", &cli_cmd__perRx, false },
  { "perStatus", &cli_cmd__perStatus, false },
  { "setBerConfig", &cli_cmd__setBerConfig, false },
  { "berRx", &cli_cmd__berRx, false },
  { "berStatus", &cli_cmd__berStatus, false },
  { "______________________________", &cli_cmd________________________________, false },
  { "____Listen_Before_Talk_LBT____", &cli_cmd______Listen_Before_Talk_LBT____, false },
  { "setLbtMode", &cli_cmd__setLbtMode, false },
  { "getLbtParams", &cli_cmd__getLbtParams, false },
  { "setLbtParams", &cli_cmd__setLbtParams, false },
  { "set802154CcaMode", &cli_cmd__set802154CcaMode, false },
  { "_____________________", &cli_cmd_______________________, false },
  { "____802_15_4_Mode____", &cli_cmd______802_15_4_Mode____, false },
  { "enable802154", &cli_cmd__enable802154, false },
  { "config2p4GHz802154", &cli_cmd__config2p4GHz802154, false },
  { "config863MHz802154", &cli_cmd__config863MHz802154, false },
  { "config915MHz802154", &cli_cmd__config915MHz802154, false },
  { "set802154e", &cli_cmd__set802154e, false },
  { "set802154g", &cli_cmd__set802154g, false },
  { "set802154FpMode", &cli_cmd__set802154FpMode, false },
  { "acceptFrames", &cli_cmd__acceptFrames, false },
  { "setPromiscuousMode", &cli_cmd__setPromiscuousMode, false },
  { "setRxToEnhAckTx", &cli_cmd__setRxToEnhAckTx, false },
  { "setPanCoordinator", &cli_cmd__setPanCoordinator, false },
  { "setPanId802154", &cli_cmd__setPanId802154, false },
  { "setShortAddr802154", &cli_cmd__setShortAddr802154, false },
  { "setLongAddr802154", &cli_cmd__setLongAddr802154, false },
  { "setAddresses802154", &cli_cmd__setAddresses802154, false },
  { "configRxChannelSwitching802154", &cli_cmd__configRxChannelSwitching802154, false },
  { "setDataReqLatency", &cli_cmd__setDataReqLatency, false },
  { "set802154PHR", &cli_cmd__set802154PHR, false },
  { "trigModeSwitchTx", &cli_cmd__trigModeSwitchTx, false },
  { "modeSwitchLife", &cli_cmd__modeSwitchLife, false },
  { "________________", &cli_cmd__________________, false },
  { "____BLE_Mode____", &cli_cmd______BLE_Mode____, false },
  { "setBleMode", &cli_cmd__setBleMode, false },
  { "getBleMode", &cli_cmd__getBleMode, false },
  { "setBleChannelParams", &cli_cmd__setBleChannelParams, false },
  { "setBlePhySwitchToRx", &cli_cmd__setBlePhySwitchToRx, false },
  { "setBleAdvertising", &cli_cmd__setBleAdvertising, false },
  { "setBle1Mbps", &cli_cmd__setBle1Mbps, false },
  { "setBle2Mbps", &cli_cmd__setBle2Mbps, false },
  { "setBleCoding", &cli_cmd__setBleCoding, false },
  { "setBleSimulscan", &cli_cmd__setBleSimulscan, false },
  { "___________________", &cli_cmd_____________________, false },
  { "____WMBUS_Mode____", &cli_cmd______WMBUS_Mode____, false },
  { "configWmbus", &cli_cmd__configWmbus, false },
  { "_______________", &cli_cmd_________________, false },
  { "____Z_Wave_Mode____", &cli_cmd______Z_Wave_Mode____, false },
  { "setZWaveMode", &cli_cmd__setZWaveMode, false },
  { "getZWaveMode", &cli_cmd__getZWaveMode, false },
  { "setZWaveRegion", &cli_cmd__setZWaveRegion, false },
  { "performZwaveIrcal", &cli_cmd__performZwaveIrcal, false },
  { "getZWaveRegion", &cli_cmd__getZWaveRegion, false },
  { "listZWaveRegions", &cli_cmd__listZWaveRegions, false },
  { "getZWaveBaudRate", &cli_cmd__getZWaveBaudRate, false },
  { "setZWaveNodeId", &cli_cmd__setZWaveNodeId, false },
  { "setZWaveHomeId", &cli_cmd__setZWaveHomeId, false },
  { "setZWaveOptions", &cli_cmd__setZWaveOptions, false },
  { "setZWaveLowPower", &cli_cmd__setZWaveLowPower, false },
  { "getZWaveLowPower", &cli_cmd__getZWaveLowPower, false },
  { "zwaveReceiveBeam", &cli_cmd__zwaveReceiveBeam, false },
  { "setMfmMode", &cli_cmd__setMfmMode, false },
  { "getMfmMode", &cli_cmd__getMfmMode, false },
  { "__________________", &cli_cmd____________________, false },
  { "____RAIL_Timer____", &cli_cmd______RAIL_Timer____, false },
  { "setTimer", &cli_cmd__setTimer, false },
  { "timerCancel", &cli_cmd__timerCancel, false },
  { "printTimerStats", &cli_cmd__printTimerStats, false },
  { "enableMultiTimer", &cli_cmd__enableMultiTimer, false },
  { "setMultiTimer", &cli_cmd__setMultiTimer, false },
  { "multiTimerCancel", &cli_cmd__multiTimerCancel, false },
  { "getMultiTimerStats", &cli_cmd__getMultiTimerStats, false },
  { "printMultiTimerStats", &cli_cmd__getMultiTimerStats, true },
  { "delayUs", &cli_cmd__delayUs, false },
  { "____________________", &cli_cmd______________________, false },
  { "____Auto_ACK_ing____", &cli_cmd______Auto_ACK_ing____, false },
  { "autoAckConfig", &cli_cmd__autoAckConfig, false },
  { "autoAckDisable", &cli_cmd__autoAckDisable, false },
  { "setAckPayload", &cli_cmd__setAckPayload, false },
  { "setAckLength", &cli_cmd__setAckLength, false },
  { "printAckPacket", &cli_cmd__printAckPacket, false },
  { "getAutoAck", &cli_cmd__getAutoAck, false },
  { "autoAckPause", &cli_cmd__autoAckPause, false },
  { "setTxAckOptions", &cli_cmd__setTxAckOptions, false },
  { "setTxAckDirect", &cli_cmd__setTxAckDirect, false },
  { "______________________", &cli_cmd________________________, false },
  { "____GPIO_Functions____", &cli_cmd______GPIO_Functions____, false },
  { "setGpioOutPin", &cli_cmd__setGpioOutPin, false },
  { "setAntDivPin", &cli_cmd__setAntDivPin, false },
  { "___________________________", &cli_cmd_____________________________, false },
  { "____Diagnostic_and_Test____", &cli_cmd______Diagnostic_and_Test____, false },
  { "getConfigIndex", &cli_cmd__getConfigIndex, false },
  { "setConfigIndex", &cli_cmd__setConfigIndex, false },
  { "setCtune", &cli_cmd__setCtune, false },
  { "getCtune", &cli_cmd__getCtune, false },
  { "setCtuneDelta", &cli_cmd__setCtuneDelta, false },
  { "getCtuneDelta", &cli_cmd__getCtuneDelta, false },
  { "setPaCtune", &cli_cmd__setPaCtune, false },
  { "enablePaCal", &cli_cmd__enablePaCal, false },
  { "setDebugSignal", &cli_cmd__setDebugSignal, false },
  { "setDebugMode", &cli_cmd__setDebugMode, false },
  { "freqOverride", &cli_cmd__freqOverride, false },
  { "configDirectMode", &cli_cmd__configDirectMode, false },
  { "directMode", &cli_cmd__directMode, false },
  { "directTx", &cli_cmd__directTx, false },
  { "txCancel", &cli_cmd__txCancel, false },
  { "configHFXOThermistor", &cli_cmd__configHFXOThermistor, false },
  { "startThermistor", &cli_cmd__startThermistor, false },
  { "startThermistorMeasurement", &cli_cmd__startThermistor, true },
  { "getThermistor", &cli_cmd__getThermistor, false },
  { "getThermistorImpedance", &cli_cmd__getThermistor, true },
  { "getRandom", &cli_cmd__getRandom, false },
  { "setTxUnderflow", &cli_cmd__setTxUnderflow, false },
  { "setRxOverflow", &cli_cmd__setRxOverflow, false },
  { "setCalibrations", &cli_cmd__setCalibrations, false },
  { "setTxTransitions", &cli_cmd__setTxTransitions, false },
  { "setRxTransitions", &cli_cmd__setRxTransitions, false },
  { "getTxTransitions", &cli_cmd__getTxTransitions, false },
  { "getRxTransitions", &cli_cmd__getRxTransitions, false },
  { "setNextTxRepeat", &cli_cmd__setNextTxRepeat, false },
  { "configTxRepeatStartToStart", &cli_cmd__configTxRepeatStartToStart, false },
  { "setNextBleTxRepeat", &cli_cmd__setNextBleTxRepeat, false },
  { "setTxTimePos", &cli_cmd__setTxTimePos, false },
  { "setRxTimePos", &cli_cmd__setRxTimePos, false },
  { "setTimings", &cli_cmd__setTimings, false },
  { "forceAssert", &cli_cmd__forceAssert, false },
  { "getAppMode", &cli_cmd__getAppMode, false },
  { "getRadioState", &cli_cmd__getRadioState, false },
  { "verifyRadio", &cli_cmd__verifyRadio, false },
  { "getChannel", &cli_cmd__getChannel, false },
  { "setChannel", &cli_cmd__setChannel, false },
  { "setPktOffsetInTxFifo", &cli_cmd__setPktOffsetInTxFifo, false },
  { "reset", &cli_cmd__reset, false },
  { "writeRmrStructure", &cli_cmd__writeRmrStructure, false },
  { "updateConfigPtr", &cli_cmd__updateConfigPtr, false },
  { "updateConfigurationPointer", &cli_cmd__updateConfigPtr, true },
  { "reconfigureModem", &cli_cmd__reconfigureModem, false },
  { "setRfPath", &cli_cmd__setRfPath, false },
  { "printEvents", &cli_cmd__printEvents, false },
  { "printChipFeatures", &cli_cmd__printChipFeatures, false },
  { "getmemw", &cli_cmd__getmemw, false },
  { "setmemw", &cli_cmd__setmemw, false },
  { "throughput", &cli_cmd__throughput, false },
  { "setRssiOffset", &cli_cmd__setRssiOffset, false },
  { "getRssiOffset", &cli_cmd__getRssiOffset, false },
  { "setRssiDetectThreshold", &cli_cmd__setRssiDetectThreshold, false },
  { "getRssiDetectThreshold", &cli_cmd__getRssiDetectThreshold, false },
  { "txAt", &cli_cmd__txAt, false },
  { "setFreqOffset", &cli_cmd__setFreqOffset, false },
  { "holdRx", &cli_cmd__holdRx, false },
  { "wait", &cli_cmd__wait, false },
  { "clearScript", &cli_cmd__clearScript, false },
  { "printScript", &cli_cmd__printScript, false },
  { "enterScript", &cli_cmd__enterScript, false },
  { "runScript", &cli_cmd__runScript, false },
  { "setRetimeOption", &cli_cmd__setRetimeOption, false },
  { "enable802154SignalIdentifier", &cli_cmd__enable802154SignalIdentifier, false },
  { "enableBleSignalIdentifier", &cli_cmd__enableBleSignalIdentifier, false },
  { "getChannelConfigEntry", &cli_cmd__getChannelConfigEntry, false },
  { "deinitProtocol", &cli_cmd__deinitProtocol, false },
  { "enableCacheSynthCal", &cli_cmd__enableCacheSynthCal, false },
  { NULL, NULL, false },
};


#ifdef __cplusplus
}
#endif
